jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F1xx_DFP.2.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>STM32F1xx_DFP</name>
  <description>STMicroelectronics STM32F1 Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="2.0.0" date="2015-10-09">
      Requires MDK-Middleware Version 6.5.0 and CMSIS Version 4.4.0
      Updated CMSIS-Drivers
      - CMSIS-Driver API V2.0 compliant
      - Added CMSIS-Driver for CAN
      Updated Examples:
      - Updated Board Support and all examples for MCBSTM32C and MCBSTM32E
      - Added examples for CAN
    </release>
    <release version="1.1.0" date="2015-02-13">
      Examples: Pack Selection for fixed version CMSIS 3.20.4 and MDK-Middleware 5.1.6
      Updated stm32f10x.h (xl-density: Added missing "STM32F10X_XL" for "RCC_AHBENR_DMA2EN" and "RCC_APB1ENR_USBEN")
    </release>
    <release version="1.0.5" date="2014-03-14">
      Component updated: Device:StdPeriph Drivers:Framework Version:3.5.1 - added file misc.c
    </release>
    <release version="1.0.4" date="2014-02-20">
      Added STM Peripheral Driver Library V1.3.0
    </release>
    <release version="1.0.3">
      Updated DMA driver (DMA2 peripheral added to build when HD, XL, HD_VL or CL device is used)
      USB Device driver update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
    </release>
    <release version="1.0.2">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.1">
      Added devices
    </release>
    <release version="1.0.0">
      First Release version of STM32F1 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F1</keyword>
    <keyword>STM32</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="STM32F1 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
      <book    name="Documents/dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
STMicroelectronics' STM32F1 series of mainstream MCUs covers the needs of a large variety of applications in the industrial, medical and consumer markets. High performance with first-class peripherals and low-power, low-voltage operation is paired with a high level of integration at accessible prices with a simple architecture and easy-to-use tools.
Typical applications include motor drives and application control, medical and handheld equipment, industrial applications, PLCs, inverters, printers, and scanners, alarm systems, video intercom, HVAC and home audio equipment.

  - LCD parallel interface, 8080/6800 modes
  - 5 V-tolerant I/Os
  - Timer with quadrature (incremental) encoder input
  - 96-bit unique ID
        </description>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="Temp"          n="-40"     m="105"/>


      <!-- ************************  Subfamily 'STM32F100'  **************************** -->
      <subFamily DsubFamily="STM32F100">
        <feature type="DAC"           n="2"       m="12"/>
      
      <!-- *************************  Device 'STM32F100C4'  ***************************** -->
      <device Dname="STM32F100C4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD_VL"/>
        <debug      svd="SVD\STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100x4_x6_x8_xB_DS.pdf"             title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="SPI"           n="1"       m="12000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="4500000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'STM32F100C6'  ***************************** -->
      <device Dname="STM32F100C6">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD_VL"/>
        <debug      svd="SVD\STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents/STM32F100x4_x6_x8_xB_DS.pdf"             title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="37"/>
        <feature type="SPI"           n="1"       m="12000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="4500000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
