jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F1xx_DFP.2.0.0.pdsc
      <!-- *************************  Device 'STM32F101ZC'  ***************************** -->
      <device Dname="STM32F101ZC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F101xC_xD_xE_DS.pdf"                title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="3"       m="4500000"/>
        <feature type="UART"          n="2"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F101ZD'  ***************************** -->
      <device Dname="STM32F101ZD">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F101xC_xD_xE_DS.pdf"                title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="3"       m="4500000"/>
        <feature type="UART"          n="2"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F101ZE'  ***************************** -->
      <device Dname="STM32F101ZE">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F101xC_xD_xE_DS.pdf"                title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="3"       m="4500000"/>
        <feature type="UART"          n="2"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F101ZF'  ***************************** -->
      <device Dname="STM32F101ZF">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_XL"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F101xF_xG_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="3"       m="4500000"/>
        <feature type="UART"          n="2"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      
      <!-- *************************  Device 'STM32F101ZG'  ***************************** -->
      <device Dname="STM32F101ZG">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_XL"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F101xF_xG_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="112"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="3"       m="4500000"/>
        <feature type="UART"          n="2"       m="4500000"/>
        <feature type="QFP"           n="144"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F102'  **************************** -->
      <subFamily DsubFamily="STM32F102">
        <feature type="USBD"          n="1"/>
      
      <!-- *************************  Device 'STM32F102C4'  ***************************** -->
      <device Dname="STM32F102C4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_LD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F102x4_x6_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="36"/>
        <feature type="SPI"           n="1"       m="12000000"/>
        <feature type="I2C"           n="1"/>
        <feature type="USART"         n="2"       m="4500000"/>
        <feature type="QFP"           n="48"/>
      </device>
      
