jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F1xx_DFP.2.0.0.pdsc
      <!-- *************************  Device 'STM32F105RB'  ***************************** -->
      <device Dname="STM32F105RB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F105xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F105RC'  ***************************** -->
      <device Dname="STM32F105RC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F105xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F105V8'  ***************************** -->
      <device Dname="STM32F105V8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F105xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="80"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F105VB'  ***************************** -->
      <device Dname="STM32F105VB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F105xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="80"/>
        <feature type="QFP"           n="100"/>
        <feature type="BGA"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F105VC'  ***************************** -->
      <device Dname="STM32F105VC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F105xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="80"/>
        <feature type="QFP"           n="100"/>
        <feature type="BGA"           n="100"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F107'  **************************** -->
      <subFamily DsubFamily="STM32F107">
        <feature type="Timer"         n="7"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="3"       m="4500000"/>
        <feature type="UART"          n="2"       m="4500000"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBOTG"        n="1"/>
        <feature type="ETH"           n="1"/>
      
      <!-- *************************  Device 'STM32F107RB'  ***************************** -->
      <device Dname="STM32F107RB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F107xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F107RC'  ***************************** -->
      <device Dname="STM32F107RC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F107xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      
      <!-- *************************  Device 'STM32F107VB'  ***************************** -->
      <device Dname="STM32F107VB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F107xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="80"/>
        <feature type="QFP"           n="100"/>
      </device>
      
      <!-- *************************  Device 'STM32F107VC'  ***************************** -->
      <device Dname="STM32F107VC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/stm32f10x.h"  define="STM32F10X_CL"/>
        <debug      svd="SVD\STM32F107xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/STM32F10x_CL.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents/STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents/STM32F105xx_7xx_DS.pdf"                  title="STM32F105 Data Sheet"/>
        <book    name="Documents/mcbstm32c.chm"                            title="MCBSTM32C User's Guide"/>
        <feature type="IOs"           n="80"/>
        <feature type="QFP"           n="100"/>
      </device>
      </subFamily>

    </family>
  </devices>

