jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F1xx_DFP.2.0.0.pdsc
    <condition id="STM32F1xx">
      <description>STMicroelectronics STM32F1xx Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1*"/>
    </condition>
    <condition id="STM32F1xx VL LD">
      <description>STMicroelectronics STM32F1xx Value Line Low Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F100?[46]"/>
    </condition>
    <condition id="STM32F1xx VL MD">
      <description>STMicroelectronics STM32F1xx Value Line Mid Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F100?[8B]"/>
    </condition>
    <condition id="STM32F1xx VL HD">
      <description>STMicroelectronics STM32F1xx Value Line Mid Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F100?[CDE]"/>
    </condition>
    <condition id="STM32F1xx LD">
      <description>STMicroelectronics STM32F1xx Low Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[46]"/>
    </condition>
    <condition id="STM32F1xx MD">
      <description>STMicroelectronics STM32F1xx Mid Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[8B]"/>
    </condition>
    <condition id="STM32F1xx HD">
      <description>STMicroelectronics STM32F1xx High Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[CDE]"/>
    </condition>
    <condition id="STM32F1xx XL">
      <description>STMicroelectronics STM32F1xx XL Density Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[123]?[FG]"/>
    </condition> 
    <condition id="STM32F1xx CL">
      <description>STMicroelectronics STM32F1xx Connectivity Line Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[57]??"/>
    </condition>

    <condition id="STM32F107">
      <description>STMicroelectronics STM32F107 Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F107??"/>
    </condition>
    <condition id="STM32F102_3">
      <description>STMicroelectronics STM32F102/103 Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[23]??"/>
    </condition>
    <condition id="STM32F105_7">
      <description>STMicroelectronics STM32F105/107 Device</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F10[57]??"/>
    </condition>

    <condition id="STM32F1xx CMSIS">
      <description>STMicroelectronics STM32F1xx Device with CMSIS</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE" Csub=""/>
    </condition>

    <condition id="STM32F1xx CMSIS GPIO">
      <description>STMicroelectronics STM32F1xx Device with CMSIS and GPIO</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>
    <condition id="STM32F107 CMSIS GPIO">
      <description>STMicroelectronics STM32F107 Device with CMSIS and GPIO</description>
      <require condition="STM32F107"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F1xx CMSIS GPIO DMA">
      <description>STMicroelectronics STM32F1xx Device with CMSIS, GPIO and DMA</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GPIO" />
      <require Cclass="Device" Cgroup="DMA" />
    </condition>

    <condition id="STM32F1xx CMSIS GPIO SPI">
      <description>STMicroelectronics STM32F1xx Device with CMSIS, GPIO and SPI Driver</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" />
    </condition>

    <condition id="STM32F102_3 CMSIS RTOS GPIO">
      <description>STMicroelectronics STM32F102/103 Device with CMSIS, RTOS and GPIO</description>
      <require condition="STM32F102_3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>
    <condition id="STM32F105_7 CMSIS RTOS GPIO">
      <description>STMicroelectronics STM32F105/107 Device with CMSIS, RTOS and GPIO</description>
      <require condition="STM32F105_7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F1xx CMSIS RTOS I2C">
      <description>STMicroelectronics STM32F1xx Device with CMSIS, RTOS and I2C Driver</description>
      <require condition="STM32F1xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" />
    </condition>

    <condition id="STM32F1xx STDPERIPH">
      <description>STMicroelectronics STM32F1xx with Standard Peripherals Drivers Framework</description>
      <require condition="STM32F1xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
    </condition>
    <condition id="STM32F1xx STDPERIPH RCC">
      <description>STMicroelectronics STM32F1xx with Standard Peripherals Drivers Framework and RCC</description>
      <require condition="STM32F1xx CMSIS"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
      <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC"/>
    </condition>
  </conditions>

  <examples>
    <!-- MCBSTM32E Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\Blinky">
      <description>CMSIS-RTOS Blinky example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

